Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [26]:
import pandas as pd 

data=[4,8,15,16,23,42]
df=pd.Series(data)
type(df)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [17]:
var=["abc",35,6,7,8,9,86,4,"data",3]
va=pd.Series(var)
type(va)

pandas.core.series.Series

Q3. Create a Pandas DataFrame that contains the following data:

In [30]:
data={'Name': ["Alice","Bob","Claire"],
    'Age': [25,30,27],
    'Gender': ["Female","male","Female"]}

df=pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.


In pandas, a DataFrame is a two-dimensional labeled data structure with columns that can be of different types. It can be thought of as a table or spreadsheet, where data is organized in rows and columns. Each column in a DataFrame is a Pandas Series.

On the other hand, a Series is a one-dimensional labeled array capable of holding any data type. It can be seen as a single column of data in a DataFrame.


The Series has only one dimension (values), while the DataFrame has two dimensions (rows and columns). The DataFrame allows you to organize and work with structured, tabular data, and it's a more powerful structure for handling real-world datasets with multiple variables.

Here's an example to illustrate the difference:

In [23]:
# Data Frame example in pandas
data={'Name': ["Alice","Bob","Claire"],
    'Age': [25,30,27],
    'Gender': ["Female","male","Female"]}
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    male
2  Claire   27  female

In [27]:
# Series example in pandas
data=[4,8,15,16,23,42]

pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [72]:
data={'Name': ["Alice","Bob","Claire",'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Age': [25,30,27,30, 35, 28, 22, 40],
    'Gender': ["Female","male","Female","Female","male","Female","Female","Female"]}
a=pd.DataFrame(data)
a.head()

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    male
2   Claire   27  Female
3      Bob   30  Female
4  Charlie   35    male

In [73]:
a.tail()

      Name  Age  Gender
3      Bob   30  Female
4  Charlie   35    male
5    David   28  Female
6      Eva   22  Female
7    Frank   40  Female

In [39]:
a.describe()

            Age
count   8.00000
mean   29.62500
std     5.68048
min    22.00000
25%    26.50000
50%    29.00000
75%    31.25000
max    40.00000

In [41]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   Gender  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

In [60]:
a.set_index('Name', inplace=True)
a

         Age  Gender
Name
Alice     25  Female
Bob       30    male
Claire    27  Female
Bob       30  Female
Charlie   35    male
David     28  Female
Eva       22  Female
Frank     40  Female

In [61]:
a.reset_index()

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    male
2   Claire   27  Female
3      Bob   30  Female
4  Charlie   35    male
5    David   28  Female
6      Eva   22  Female
7    Frank   40  Female

In [78]:
a.drop("Name",axis=1)

   Age  Gender
0   25  Female
1   30    male
2   27  Female
3   30  Female
4   35    male
5   28  Female
6   22  Female
7   40  Female

In [84]:
b=a.groupby(by="Gender")["Age"].mean()
b

Gender
Female    28.666667
male      32.500000
Name: Age, dtype: float64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, both Series and DataFrame are mutable, while Panel is considered deprecated since version 0.25.0 and is no longer recommended for use. As of my knowledge cutoff in January 2022, Series and DataFrame are the primary data structures in Pandas.

Mutable means that you can modify the content of the object after it has been created. In the case of Series and DataFrame:

Series can be modified by changing values or adding/removing elements.
DataFrame can be modified by adding or removing columns, changing values, or altering the structure of the DataFrame.
Here's a simple example to illustrate the mutability of a DataFrame:

In [85]:
import pandas as pd

# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}
df = pd.DataFrame(data)

# Displaying the original DataFrame
print("Original DataFrame:")
print(df)
print("\n")

# Modifying the DataFrame
df['Age'] = [26, 31, 36]  # Changing values in the 'Age' column
df['Salary'] = [50000, 60000, 70000]  # Adding a new 'Salary' column
df.drop('City', axis=1, inplace=True)  # Removing the 'City' column

# Displaying the modified DataFrame
print("Modified DataFrame:")
print(df)

Original DataFrame:
      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles


Modified DataFrame:
      Name  Age  Salary
0    Alice   26   50000
1      Bob   31   60000
2  Charlie   36   70000

Q7. Create a DataFrame using multiple Series. Explain with an example.


Certainly! You can create a DataFrame using multiple Series by combining them into a dictionary where each key-value pair represents a column name and the corresponding Series. Here's an example:

In [88]:
s1=pd.Series([2,45,6,7,85,3])
s2=pd.Series(["a","b","c","d",'e','f'])
s3=pd.Series([2.4,53,5,67,5,67])
data={"CA":s1,"CB":s2,"CC":s3}
df= pd.DataFrame(data)
df

   CA CB    CC
0   2  a   2.4
1  45  b  53.0
2   6  c   5.0
3   7  d  67.0
4  85  e   5.0
5   3  f  67.0